data/collected_data/orange/api/standarda8v2/a/load_compose.txt
Running 30m test @ http://20.108.167.175:60/wrk2-api/post/compose
  2 threads and 1000 connections
  Thread calibration: mean lat.: 2398.400ms, rate sampling interval: 12451ms
  Thread calibration: mean lat.: 2466.518ms, rate sampling interval: 13082ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.47m     7.11m   24.68m    57.67%
    Req/Sec    75.45      4.39    84.00     81.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.60m 
 75.000%   18.56m 
 90.000%   22.25m 
 99.000%   24.68m 
 99.900%   25.57m 
 99.990%   25.99m 
 99.999%   26.16m 
100.000%   26.27m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     931.327     0.000000            1         1.00
  152305.663     0.100000        27199         1.11
  303824.895     0.200000        54396         1.25
  453509.119     0.300000        81599         1.43
  605552.639     0.400000       108798         1.67
  756023.295     0.500000       136027         2.00
  832045.055     0.550000       149572         2.22
  903348.223     0.600000       163209         2.50
  968884.223     0.650000       176811         2.86
 1037565.951     0.700000       190386         3.33
 1113587.711     0.750000       204009         4.00
 1154482.175     0.775000       210782         4.44
 1194328.063     0.800000       217573         5.00
 1234173.951     0.825000       224434         5.71
 1270874.111     0.850000       231253         6.67
 1303379.967     0.875000       237977         8.00
 1319108.607     0.887500       241422         8.89
 1334837.247     0.900000       244836        10.00
 1350565.887     0.912500       248290        11.43
 1366294.527     0.925000       251615        13.33
 1382023.167     0.937500       254945        16.00
 1390411.775     0.943750       256728        17.78
 1399848.959     0.950000       258528        20.00
 1409286.143     0.956250       260199        22.86
 1418723.327     0.962500       261786        26.67
 1430257.663     0.968750       263574        32.00
 1435500.543     0.971875       264355        35.56
 1441791.999     0.975000       265233        40.00
 1448083.455     0.978125       266030        45.71
 1454374.911     0.981250       266818        53.33
 1462763.519     0.984375       267724        64.00
 1466957.823     0.985938       268115        71.11
 1472200.703     0.987500       268571        80.00
 1476395.007     0.989062       268938        91.43
 1482686.463     0.990625       269414       106.67
 1488977.919     0.992188       269832       128.00
 1492123.647     0.992969       270015       142.22
 1496317.951     0.993750       270268       160.00
 1499463.679     0.994531       270429       182.86
 1503657.983     0.995313       270637       213.33
 1508900.863     0.996094       270886       256.00
 1510998.015     0.996484       270971       284.44
 1514143.743     0.996875       271071       320.00
 1517289.471     0.997266       271204       365.71
 1519386.623     0.997656       271275       426.67
 1523580.927     0.998047       271386       512.00
 1525678.079     0.998242       271451       568.89
 1527775.231     0.998437       271498       640.00
 1529872.383     0.998633       271550       731.43
 1531969.535     0.998828       271601       853.33
 1534066.687     0.999023       271646      1024.00
 1536163.839     0.999121       271680      1137.78
 1538260.991     0.999219       271709      1280.00
 1540358.143     0.999316       271727      1462.86
 1543503.871     0.999414       271767      1706.67
 1544552.447     0.999512       271779      2048.00
 1546649.599     0.999561       271801      2275.56
 1547698.175     0.999609       271808      2560.00
 1548746.751     0.999658       271821      2925.71
 1549795.327     0.999707       271833      3413.33
 1551892.479     0.999756       271845      4096.00
 1552941.055     0.999780       271852      4551.11
 1553989.631     0.999805       271862      5120.00
 1555038.207     0.999829       271867      5851.43
 1557135.359     0.999854       271873      6826.67
 1558183.935     0.999878       271882      8192.00
 1558183.935     0.999890       271882      9102.22
 1560281.087     0.999902       271888     10240.00
 1560281.087     0.999915       271888     11702.86
 1561329.663     0.999927       271894     13653.33
 1562378.239     0.999939       271895     16384.00
 1563426.815     0.999945       271897     18204.44
 1564475.391     0.999951       271898     20480.00
 1565523.967     0.999957       271901     23405.71
 1566572.543     0.999963       271905     27306.67
 1566572.543     0.999969       271905     32768.00
 1566572.543     0.999973       271905     36408.89
 1566572.543     0.999976       271905     40960.00
 1568669.695     0.999979       271906     46811.43
 1569718.271     0.999982       271908     54613.33
 1569718.271     0.999985       271908     65536.00
 1569718.271     0.999986       271908     72817.78
 1569718.271     0.999988       271908     81920.00
 1572863.999     0.999989       271910     93622.86
 1572863.999     0.999991       271910    109226.67
 1572863.999     0.999992       271910    131072.00
 1572863.999     0.999993       271910    145635.56
 1572863.999     0.999994       271910    163840.00
 1572863.999     0.999995       271910    187245.71
 1572863.999     0.999995       271910    218453.33
 1572863.999     0.999996       271910    262144.00
 1576009.727     0.999997       271911    291271.11
 1576009.727     1.000000       271911          inf
#[Mean    =   748387.436, StdDeviation   =   426809.806]
#[Max     =  1574961.152, Total count    =       271911]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  273101 requests in 30.00m, 57.69MB read
  Socket errors: connect 0, read 490, write 10647, timeout 774569
  Non-2xx or 3xx responses: 51720
Requests/sec:    151.72
Transfer/sec:     32.82KB